kiran-embedded/esp32-smart-light-app/esp32_firmware_pro.ino
/*
 * NEBULA CORE – COMPLETE SYSTEM (CLOUD-ONLY EDITION)
 * VERSION: v1.6.5-ULTIMATE-PRO-GOLD
 * ------------------------------------------------
 * STATUS LED LOGIC:
 * PRIORITY 1: OTA Update (Red/Blue Strobe).
 * PRIORITY 2: Data Flash (Blue) -> Overrides Status.
 * PRIORITY 3: Status (Green=OK, Red=No Network).
 */

#include <ArduinoOTA.h>
#include <ESPmDNS.h>
#include <Firebase_ESP_Client.h>
#include <WiFi.h>
#include <WiFiUdp.h>
#include <esp_now.h>
#include <esp_task_wdt.h>
#include <map>
#include <set>
#include <time.h>

#include "addons/RTDBHelper.h"
#include "addons/TokenHelper.h"

/* ================= CONFIGURATION ================= */
#define WIFI_SSID "Kerala_Vision"
#define WIFI_PASS "chandrasekharan0039"
#define OTA_HOSTNAME "Nebula-Core-ESP32"
#define OTA_PASSWORD "nebula2024"
#define API_KEY "AIzaSyA9zs6xhRcEwwGLO6cI417b2FO52PiXaxs"
#define DATABASE_URL                                                           \
  "https://"                                                                   \
  "nebula-smartpowergrid-default-rtdb.asia-southeast1.firebasedatabase.app"

/* ================= PIN DEFINITIONS ================= */
#define RELAY1 26
#define RELAY2 27
#define RELAY3 25
#define RELAY4 33
#define RELAY5 32
#define RELAY6 14
#define RELAY7 23
#define VOLTAGE_SENSOR 34
#define BUZZER_PIN 13

#define LED_PIN_RED 19
#define LED_PIN_GREEN 16
#define LED_PIN_BLUE 17

/* ================= CONSTANTS ================= */
#define ADC_MAX 4095.0
#define VREF 3.3
float calibrationFactor = 313.3;
#define P2P_THRESHOLD 60
#define RMS_THRESHOLD 0.020
#define SMOOTHING_ALPHA 0.1
#define DEADMAN_TIMEOUT_MS 120000
#define LED_PULSE_MS 100
#define MANUAL_LOCKOUT_TIMEOUT_MS 900000 // 15-Minute Priority Lockout

/* ================= GLOBALS ================= */
FirebaseData fbTele;
FirebaseData fbStream;
FirebaseAuth auth;
FirebaseConfig config;

bool isOTAActive = false;
bool isInternetLive = false;
String deviceId = "79215788";

bool relayState[7] = {0, 0, 0, 0, 0, 0, 0};
bool invertedLogic[7] = {0, 0, 0, 0, 0, 0, 0};
String autoSensor[7] = {"", "", "", "", "", "", ""};
int autoDuration[7] = {0, 0, 0, 0, 0, 0, 0};
int autoThreshold[7] = {0, 0, 0, 0, 0, 0, 0};
bool autoActive[7] = {false, false, false, false, false, false, false};
unsigned long autoTriggerTime[7] = {0, 0, 0, 0, 0, 0, 0};
bool isNeuralTriggered[7] = {false, false, false, false, false, false, false};
unsigned long manualOverrideTime[7] = {0, 0, 0, 0, 0, 0, 0};
int relayPriority[7] = {0, 0, 0, 0, 0, 0, 0}; // 0: Auto, 1: Motion, 2: Manual

int pirTimer = 60;
int autoTimeMode[7] = {0, 0, 0, 0, 0, 0, 0};
int mapPIR[5] = {0, 0, 0, 0, 0};
int pirDetectionCount[5] = {1, 1, 1, 1, 1};
int pirDebounce[5] = {200, 200, 200, 200, 200};

bool activePeriods[5] = {true, true, true, true, true};
const char *periodNames[5] = {"morning", "afternoon", "evening", "night",
                              "midnight"};

std::map<String, int> sensorDebounce;
std::map<String, int> sensorSensitivity;
std::map<String, int> sensorHitCounter;
std::map<String, int> sensorMode;
std::map<String, unsigned long> lastTriggerTimeMap;

bool updateRelays = false;
bool forceTelemetry = false;
volatile float sharedVoltage = 0.0;
unsigned long lastTelemetryTime = 0;
float lastReportedVoltage = 0;
bool isArmed = false;
bool isBuzzerMuted = false;
bool isAutoGlobalEnabled = true;
unsigned long blueLedOffTime = 0;
int globalLdrThreshold = 50;
int globalLdrValue = 0;
int securityMode = 2; // 0: LDR, 1: Schedule, 2: Hybrid
bool ldrValid = false;
unsigned long lastLdrUpdate = 0;
bool isEcoMode = false;
int reportInterval = 8000;
unsigned long systemInitTime = 0;

String pathTele, pathCmds, pathSensors;
bool isActivityFlashing = false;
unsigned long activityStart = 0;
bool isPanicActive = false;
bool isPanicResume = false;
std::map<String, int> motionBatchCounter;
std::map<String, unsigned long> motionBatchStartTime;
unsigned long lastLogTime = 0;
bool safetyTripped = false;
unsigned long lastCloudActivity = 0;
int systemEventCount = 0;

/* ================= MESH STRUCTURE ================= */
typedef struct struct_message {
  char sensorId[16];
  bool motion;
  int lightLevel;
} struct_message;

struct_message incomingData;
volatile bool meshDataPending = false;

/* ================= LED ENGINE ================= */
void initLEDs() {
  pinMode(LED_PIN_RED, OUTPUT);
  pinMode(LED_PIN_GREEN, OUTPUT);
  pinMode(LED_PIN_BLUE, OUTPUT);
  digitalWrite(LED_PIN_RED, LOW);
  digitalWrite(LED_PIN_GREEN, LOW);
  digitalWrite(LED_PIN_BLUE, LOW);
}

void triggerActivityLED() {
  isActivityFlashing = true;
  activityStart = millis();
}

void animateLEDs() {
  unsigned long now = millis();
  if (blueLedOffTime > 0 && now > blueLedOffTime) {
    digitalWrite(LED_PIN_BLUE, LOW);
    blueLedOffTime = 0;
  }
  int targetColor = 0;

  if (isOTAActive) {
    targetColor = ((now / 100) % 2 == 0) ? 1 : 3;
  } else if (isActivityFlashing) {
    if (now - activityStart < 80)
      targetColor = 3;
    else
      isActivityFlashing = false;
  }

  if (targetColor == 0 && !isActivityFlashing && !isOTAActive) {
    if (WiFi.status() != WL_CONNECTED) {
      targetColor = ((now / 200) % 2 == 0) ? 2 : 3;
    } else if (!isInternetLive) {
      if ((now / 1500) % 2 == 0)
        targetColor = 1;
    } else {
      unsigned long cycle = now % (isEcoMode ? 4000 : 2000);
      if (cycle < 80 || (cycle > 250 && cycle < 330))
        targetColor = 2;
    }
  }

  digitalWrite(LED_PIN_RED, (targetColor == 1) ? HIGH : LOW);
  digitalWrite(LED_PIN_GREEN, (targetColor == 2) ? HIGH : LOW);
  if (blueLedOffTime > 0 && now < blueLedOffTime)
    digitalWrite(LED_PIN_BLUE, HIGH);
  else
    digitalWrite(LED_PIN_BLUE, (targetColor == 3) ? HIGH : LOW);

  if (isPanicActive) {
    if (now - lastPanicPulse > 500) {
      triggerBuzzer(250);
      lastPanicPulse = now;
    }
  } else {
    digitalWrite(BUZZER_PIN, LOW);
  }
  if (buzzerPending) {
    if (now - buzzerStartTime < buzzerDuration) {
      if (!isBuzzerMuted)
        digitalWrite(BUZZER_PIN, HIGH);
    } else {
      digitalWrite(BUZZER_PIN, LOW);
      buzzerPending = false;
    }
  }
}

void triggerBuzzer(int ms) {
  if (isBuzzerMuted && !isPanicActive)
    return;
  buzzerPending = true;
  buzzerStartTime = millis();
  buzzerDuration = ms;
  digitalWrite(BUZZER_PIN, HIGH);
}

