kiran-embedded/esp32-smart-light-app/esp32_firmware_pro.ino
/* ================= BACKGROUND TASKS ================= */
void connectivityTask(void *pvParameters) {
  for (;;) {
    int delayTime = isEcoMode ? 15000 : 8000;
    if (WiFi.status() != WL_CONNECTED) {
      isInternetLive = false;
      delayTime = 1000;
    } else if (!isInternetLive) {
      WiFiClient client;
      client.setTimeout(1500);
      if (client.connect("8.8.8.8", 53)) {
        isInternetLive = true;
        client.stop();
      } else {
        delayTime = 3000;
      }
    }
    vTaskDelay(delayTime / portTICK_PERIOD_MS);
  }
}

void voltageTask(void *pvParameters) {
  long sum = 0;
  for (int i = 0; i < 500; i++)
    sum += analogRead(VOLTAGE_SENSOR);
  float adcOffset = sum / 500.0;
  float localVoltage = 0;

  for (;;) {
    double rmsSum = 0;
    int rmsCount = 0;
    int rmsMin = 4095, rmsMax = 0;
    unsigned long burstStart = millis();
    while (millis() - burstStart < 20) {
      int raw = analogRead(VOLTAGE_SENSOR);
      if (raw < rmsMin)
        rmsMin = raw;
      if (raw > rmsMax)
        rmsMax = raw;
      float v = (raw - adcOffset) * (VREF / ADC_MAX);
      rmsSum += v * v;
      rmsCount++;
      yield();
    }
    if (rmsCount > 0) {
      int p2p = rmsMax - rmsMin;
      float rms = sqrt(rmsSum / rmsCount);
      float instVoltage = (p2p >= P2P_THRESHOLD && rms >= RMS_THRESHOLD)
                              ? (rms * calibrationFactor)
                              : 0.0;
      localVoltage = (localVoltage == 0)
                         ? instVoltage
                         : (instVoltage * SMOOTHING_ALPHA) +
                               (localVoltage * (1.0 - SMOOTHING_ALPHA));
      sharedVoltage = (localVoltage < 5.0) ? 0.0 : localVoltage;
    }
    vTaskDelay((isEcoMode ? 200 : 100) / portTICK_PERIOD_MS);
  }
}

/* ================= HARDWARE CONTROL ================= */
void applyRelays() {
  int pins[] = {RELAY1, RELAY2, RELAY3, RELAY4, RELAY5, RELAY6, RELAY7};
  for (int i = 0; i < 7; i++) {
    bool target = (relayState[i] != invertedLogic[i]);
    digitalWrite(pins[i], target ? HIGH : LOW);
  }
  forceTelemetry = true;
}

void triggerHardware() {
  updateRelays = true;
  applyRelays();
  updateRelays = false;
}

/* ================= PRIORITY LOGIC ================= */
bool canUpdateRelay(int idx, int newPriority) {
  if (newPriority >= relayPriority[idx])
    return true;
  if (millis() - manualOverrideTime[idx] > MANUAL_LOCKOUT_TIMEOUT_MS)
    return true;
  return false;
}

void applyRelayUpdate(int idx, int state, int priority) {
  if (canUpdateRelay(idx, priority)) {
    relayState[idx] = state;
    relayPriority[idx] = priority;
    if (priority == 2)
      manualOverrideTime[idx] = millis();
    updateRelays = true;
    forceTelemetry = true;

    // Relay Acknowledgement (Status Node)
    String statusPath =
        "devices/" + deviceId + "/status/relays/r" + String(idx + 1);
    Firebase.RTDB.setIntAsync(&fbTele, statusPath.c_str(), state);
  }
}

/* ================= STREAM CALLBACK ================= */
void logEvent(String type, String sensor = "", String details = "") {
  if (millis() - lastLogTime < 200)
    return;
  lastLogTime = millis();
  String path = "devices/" + deviceId + "/events";
  FirebaseJson event;
  event.set("type", type);
  if (sensor != "")
    event.set("sensor", sensor);
  if (details != "")
    event.set("details", details);
  double ts =
      (time(nullptr) > 1000000) ? (double)time(nullptr) : (double)millis();
  event.set("timestamp", ts);
  Firebase.RTDB.pushJSONAsync(&fbTele, path.c_str(), &event);

  systemEventCount++;
  if (systemEventCount > 200) {
    Firebase.RTDB.deleteNodeAsync(&fbTele, path.c_str());
    systemEventCount = 0;
  }
}

void streamCallback(FirebaseStream data) {
  digitalWrite(LED_PIN_BLUE, HIGH);
  blueLedOffTime = millis() + LED_PULSE_MS;
  isInternetLive = true;
  lastCloudActivity = millis();
  String path = data.dataPath();
  bool wasRelayUpdated = false;

  if (path == "/") {
    FirebaseJson *json = data.jsonObjectPtr();
    FirebaseJsonData d;
    for (int i = 0; i < 7; i++) {
      char rKey[16], pKey[16];
      sprintf(rKey, "relay%d", i + 1);
      sprintf(pKey, "prio%d", i + 1);
      int newState = -1;
      int newPrio = -1;

      if (json->get(d, rKey))
        newState = d.intValue;
      if (json->get(d, pKey))
        newPrio = d.intValue;

      if (newState != -1) {
        if (newPrio == -1)
          newPrio = 2; // Default to Manual if not specified
        applyRelayUpdate(i, newState, newPrio);
        wasRelayUpdated = true;
      }
    }

    if (json->get(d, "invert1"))
      invertedLogic[0] = d.boolValue;
    if (json->get(d, "invert2"))
      invertedLogic[1] = d.boolValue;
    if (json->get(d, "invert3"))
      invertedLogic[2] = d.boolValue;
    if (json->get(d, "invert4"))
      invertedLogic[3] = d.boolValue;
    if (json->get(d, "invert5"))
      invertedLogic[4] = d.boolValue;
    if (json->get(d, "invert6"))
      invertedLogic[5] = d.boolValue;
    if (json->get(d, "invert7"))
      invertedLogic[6] = d.boolValue;

    if (json->get(d, "ecoMode"))
      isEcoMode = d.boolValue;
    if (json->get(d, "panic")) {
      isPanicActive = d.boolValue;
      if (isPanicActive)
        triggerBuzzer(1000);
      else
        Firebase.RTDB.deleteNodeAsync(
            &fbTele,
            ("devices/" + deviceId + "/security/activeBreaches").c_str());
    }
    if (json->get(d, "security/securityMode"))
      securityMode = d.intValue;
    if (json->get(d, "isArmed") || json->get(d, "security/isArmed")) {
      isArmed = d.boolValue;
      if (!isArmed)
        Firebase.RTDB.deleteNodeAsync(
            &fbTele,
            ("devices/" + deviceId + "/security/activeBreaches").c_str());
    }
    if (json->get(d, "buzzerMute"))
      isBuzzerMuted = d.boolValue;
    if (json->get(d, "ldrThreshold"))
      globalLdrThreshold = d.intValue;
    if (json->get(d, "pirTimer"))
      pirTimer = d.intValue;

    if (json->get(d, "security/masterLDR")) {
      globalLdrValue = d.intValue;
      ldrValid = true;
      lastLdrUpdate = millis();
    }

    if (json->get(d, "autoGlobal") || json->get(d, "autoLightOnMotion") ||
        json->get(d, "security/autoGlobal") ||
        json->get(d, "security/autoLightOnMotion"))
      isAutoGlobalEnabled = d.boolValue;

    for (int i = 1; i <= 4; i++) {
      char key[16], sKey[48], dKey[48];
      sprintf(key, "mapPIR%d", i);
      sprintf(sKey, "security/calibration/PIR%d/detection_count", i);
      sprintf(dKey, "security/calibration/PIR%d/debounce", i);
      char mKey[48];
      sprintf(mKey, "security/calibration/PIR%d/mode", i);
      if (json->get(d, key))
        mapPIR[i - 1] = d.intValue;
      if (json->get(d, sKey))
        pirDetectionCount[i - 1] = d.intValue;
      if (json->get(d, dKey))
        pirDebounce[i - 1] = d.intValue;
      if (json->get(d, mKey))
        sensorMode["PIR" + String(i)] = d.intValue;
    }
    for (int i = 0; i < 5; i++) {
      char pKey[32];
      sprintf(pKey, "security/activePeriods/%s", periodNames[i]);
      if (json->get(d, pKey))
        activePeriods[i] = d.boolValue;
      if (json->get(d, periodNames[i]))
        activePeriods[i] = d.boolValue;
    }
    for (int i = 1; i <= 7; i++) {
      char sKey[16], dKey[16], tKey[16], aKey[16], mKey[16];
      sprintf(sKey, "auto_r%d_sen", i);
      sprintf(dKey, "auto_r%d_dur", i);
      sprintf(tKey, "auto_r%d_thr", i);
      sprintf(aKey, "auto_r%d_act", i);
      sprintf(mKey, "auto_r%d_tm", i);
      if (json->get(d, sKey))
        autoSensor[i - 1] = d.stringValue;
      if (json->get(d, dKey))
        autoDuration[i - 1] = d.intValue;
      if (json->get(d, tKey))
        autoThreshold[i - 1] = d.intValue;
      if (json->get(d, aKey))
        autoActive[i - 1] = d.boolValue;
      if (json->get(d, mKey))
        autoTimeMode[i - 1] = d.intValue;
    }

    // 🧪 TEST MESH SIMULATION
    if (json->get(d, "testMesh") && d.boolValue) {
      strcpy(incomingData.sensorId, "PIR1");
      incomingData.motion = true;
      incomingData.lightLevel = 45;
      meshDataPending = true;
      Firebase.RTDB.setBoolAsync(&fbTele, (pathCmds + "/testMesh").c_str(),
                                 false);
    }
  } else {
    // === INDIVIDUAL PATH UPDATES ===
    if (path.startsWith("/relay")) {
      int idx = path.substring(6).toInt() - 1;
      if (idx >= 0 && idx < 7) {
        applyRelayUpdate(idx, data.intData(), 2);
      }
    } else if (path == "/isArmed") {
      isArmed = data.boolData();
    } else if (path == "/buzzerMute") {
      isBuzzerMuted = data.boolData();
    } else if (path == "/ldrThreshold") {
      globalLdrThreshold = data.intData();
    } else if (path == "/autoGlobal" || path == "/autoLightOnMotion") {
      isAutoGlobalEnabled = data.boolData();
    } else if (path == "/panic" || path == "/security/panic") {
      isPanicActive = data.boolData();
      if (isPanicActive)
        triggerBuzzer(1000);
      else
        Firebase.RTDB.deleteNodeAsync(
            &fbTele,
            ("devices/" + deviceId + "/security/activeBreaches").c_str());
    } else if (path.startsWith("/security/calibration/PIR")) {
      int pIdx = path.substring(25, 26).toInt() - 1;
      if (pIdx >= 0 && pIdx < 4) {
        if (path.endsWith("/detection_count"))
          pirDetectionCount[pIdx] = data.intData();
        else if (path.endsWith("/debounce"))
          pirDebounce[pIdx] = data.intData();
        else if (path.endsWith("/mode"))
          sensorMode["PIR" + String(pIdx + 1)] = data.intData();
      }
    } else if (path == "/security/securityMode") {
      securityMode = data.intData();
    } else if (path.startsWith("/security/activePeriods/")) {
      String period = path.substring(24);
      for (int i = 0; i < 5; i++) {
        if (period == periodNames[i]) {
          activePeriods[i] = data.boolData();
          break;
        }
      }
    }
  }

  triggerHardware();
  lastTelemetryTime = millis() - reportInterval + 500;
  triggerActivityLED();
}

void streamTimeoutCallback(bool timeout) {
  if (timeout)
    isInternetLive = false;
}

