kiran-embedded/esp32-smart-light-app/esp32_firmware_pro.ino
/* ================= ESP-NOW CALLBACK ================= */
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
void OnDataRecv(const esp_now_recv_info *info, const uint8_t *data, int len) {
#else
void OnDataRecv(const uint8_t *mac_addr, const uint8_t *data, int len) {
#endif
  memcpy(&incomingData, data, sizeof(incomingData));
  meshDataPending = true;
}

/* ================= SETUP ================= */
void setup() {
  Serial.begin(115200);
  delay(500);
  initLEDs();

  pinMode(RELAY1, OUTPUT);
  pinMode(RELAY2, OUTPUT);
  pinMode(RELAY3, OUTPUT);
  pinMode(RELAY4, OUTPUT);
  pinMode(RELAY5, OUTPUT);
  pinMode(RELAY6, OUTPUT);
  pinMode(RELAY7, OUTPUT);
  pinMode(BUZZER_PIN, OUTPUT);

  analogReadResolution(12);
  analogSetAttenuation(ADC_11db);

  WiFi.mode(WIFI_STA);
  WiFi.setSleep(false);
  WiFi.setAutoReconnect(true);
  WiFi.begin(WIFI_SSID, WIFI_PASS);

  pathTele = "devices/" + deviceId + "/telemetry";
  pathCmds = "devices/" + deviceId + "/commands";
  pathSensors = "devices/" + deviceId + "/security/sensors";

  unsigned long startT = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - startT < 10000) {
    delay(100);
    animateLEDs();
  }

  if (WiFi.status() == WL_CONNECTED) {
    configTime(19800, 0, "pool.ntp.org");
    xTaskCreatePinnedToCore(connectivityTask, "ConnTask", 2048, NULL, 1, NULL,
                            0);
    systemInitTime = millis();
    for (int i = 0; i < 3; i++) {
      digitalWrite(BUZZER_PIN, HIGH);
      delay(50);
      digitalWrite(BUZZER_PIN, LOW);
      delay(50);
    }
  }

  ArduinoOTA.setHostname(OTA_HOSTNAME);
  ArduinoOTA.setPassword(OTA_PASSWORD);
  ArduinoOTA.begin();

  config.api_key = API_KEY;
  config.database_url = DATABASE_URL;
  config.token_status_callback = tokenStatusCallback;
  Firebase.signUp(&config, &auth, "", "");
  Firebase.begin(&config, &auth);

  Firebase.RTDB.beginStream(&fbStream, pathCmds.c_str());
  Firebase.RTDB.setStreamCallback(&fbStream, streamCallback,
                                  streamTimeoutCallback);

  if (esp_now_init() == ESP_OK) {
    esp_now_register_recv_cb(OnDataRecv);
    esp_now_peer_info_t peerInfo = {};
    memset(peerInfo.peer_addr, 0xFF, 6);
    peerInfo.channel = 0;
    peerInfo.encrypt = false;
    esp_now_add_peer(&peerInfo);
  }
  xTaskCreatePinnedToCore(voltageTask, "VoltageTask", 5120, NULL, 1, NULL, 0);

  Firebase.RTDB.setStringAsync(&fbTele, (pathTele + "/hubMac").c_str(),
                               WiFi.macAddress());

  // === WATCHDOG INITIALIZATION ===
  esp_task_wdt_init(30, true); // 30 second timeout
  esp_task_wdt_add(NULL);      // Add current thread (Main Loop)

  // Presence & Cleanup Nodes
  Firebase.RTDB.setBoolAsync(
      &fbTele, ("devices/" + deviceId + "/status/online").c_str(), true);
  Firebase.RTDB.deleteNodeAsync(&fbTele,
                                ("devices/" + deviceId + "/events").c_str());
  Firebase.RTDB.deleteNodeAsync(
      &fbTele, ("devices/" + deviceId + "/security/activeBreaches").c_str());
  Firebase.RTDB.setIntAsync(
      &fbTele, ("devices/" + deviceId + "/security/masterLDR").c_str(), 0);
  Firebase.RTDB.setBoolAsync(
      &fbTele, ("devices/" + deviceId + "/status/ldrValid").c_str(), false);
  Firebase.RTDB.setIntAsync(
      &fbTele, ("devices/" + deviceId + "/status/rssi").c_str(), -100);

  Serial.println("✅ SYSTEM READY.");
}

/* ================= HELPERS ================= */
int getCurrentPeriodIdx() {
  struct tm timeinfo;
  if (!getLocalTime(&timeinfo))
    return -1;
  int h = timeinfo.tm_hour;
  if (h >= 6 && h < 12)
    return 0;
  if (h >= 12 && h < 17)
    return 1;
  if (h >= 17 && h < 20)
    return 2;
  if (h >= 20 && h <= 23)
    return 3;
  return 4;
}

void processMeshData() {
  if (!meshDataPending)
    return;
  unsigned long now = millis();
  String sid = String(incomingData.sensorId);

  // 🛡️ BOOT GUARD (15s stabilization)
  if (now - systemInitTime < 15000) {
    meshDataPending = false;
    return;
  }

  int curP = getCurrentPeriodIdx();
  bool isScheduled = (curP == -1 || activePeriods[curP]);

  // LDR Update & Stale Check
  if (sid.startsWith("PIR") || sid == "NODE_GOLD") {
    globalLdrValue = incomingData.lightLevel;
    ldrValid = true;
    lastLdrUpdate = now;
  }
  if (now - lastLdrUpdate > 60000)
    ldrValid = false;

  // Security Mode Decision (Individual Sensor Privilege)
  bool isDark = !ldrValid || (globalLdrValue <= globalLdrThreshold);
  bool systemActive = false;
  int sMode = (sensorMode.count(sid) > 0) ? sensorMode[sid] : securityMode;

  if (sMode == 0)
    systemActive = isDark;
  else if (sMode == 1)
    systemActive = isScheduled;
  else if (sMode == 2)
    systemActive = isScheduled && isDark;

  int debounceVal = 800;
  int pIdx = (sid.startsWith("PIR") && sid.length() >= 4)
                 ? (sid.substring(3).toInt() - 1)
                 : -1;
  if (pIdx >= 0 && pIdx < 4)
    debounceVal = pirDebounce[pIdx];

  if (incomingData.motion &&
      (now - lastTriggerTimeMap[sid] < (unsigned long)debounceVal)) {
    meshDataPending = false;
    return;
  }

  // Log Telemetry
  FirebaseJson sensorData;
  sensorData.set("status", incomingData.motion);
  sensorData.set("lightLevel", incomingData.lightLevel);
  if (incomingData.motion)
    sensorData.set("lastTriggered", (int)time(NULL));
  Firebase.RTDB.setJSONAsync(&fbTele, (pathSensors + "/" + sid).c_str(),
                             &sensorData);

  if (incomingData.motion) {
    // 🎯 TEMPORAL EVENT COMPRESSION (Batching)
    motionBatchCounter[sid]++;
    if (motionBatchStartTime[sid] == 0)
      motionBatchStartTime[sid] = now;
    if (now - motionBatchStartTime[sid] > 10000) {
      logEvent("motion_batch", sid, String(motionBatchCounter[sid]));
      motionBatchCounter[sid] = 0;
      motionBatchStartTime[sid] = now;
    }

    int reqHits = 1;
    if (pIdx >= 0 && pIdx < 4)
      reqHits = pirDetectionCount[pIdx];

    unsigned long timeSinceLast = now - lastTriggerTimeMap[sid];
    int window = (reqHits >= 3) ? 10000 : 15000;

