kiran-embedded/esp32-smart-light-app/esp32_firmware_pro.ino
    if (reqHits > 1 && timeSinceLast > window)
      sensorHitCounter[sid] = 1;
    else
      sensorHitCounter[sid]++;

    lastTriggerTimeMap[sid] = now;

    if (sensorHitCounter[sid] >= reqHits) {
      sensorHitCounter[sid] = 0;
      // Automation
      if (isAutoGlobalEnabled && systemActive) {
        if (pIdx >= 0 && pIdx < 4) {
          int mask = mapPIR[pIdx];
          for (int r = 0; r < 7; r++) {
            if ((mask & (1 << r)) != 0) {
              applyRelayUpdate(r, 1, 1);
              autoTriggerTime[r] = now;
              isNeuralTriggered[r] = true;
            }
          }
        }
      }
      // Alarm (Forensic Push Sequencing)
      if (isArmed && systemActive && !isPanicActive) {
        triggerBuzzer(400);
        String breachPath = "devices/" + deviceId + "/security/activeBreaches";
        FirebaseJson breach;
        breach.set("sensor", sid);
        breach.set("timestamp", (int)time(NULL));
        Firebase.RTDB.pushJSONAsync(&fbTele, breachPath.c_str(), &breach);
        logEvent("security_breach", sid, "Zone Alert");
      }
    }
  } else {
    // 💤 Reset temporal batcher on idle
    motionBatchStartTime[sid] = 0;
    motionBatchCounter[sid] = 0;
  }

  meshDataPending = false;
}

void loop() {
  animateLEDs();
  ArduinoOTA.handle();
  processMeshData();

  // 🏥 Self-Healing Stream Monitor
  if (millis() - lastCloudActivity > 30000) { // Check every 30s
    if (Firebase.ready() && isInternetLive) {
      if (!Firebase.RTDB.readStream(&fbStream)) {
        Serial.println("♻️ Restarting Stream...");
        Firebase.RTDB.beginStream(&fbStream, pathCmds.c_str());
      }
      lastCloudActivity = millis();
    }
  }

  if (updateRelays) {
    applyRelays();
    updateRelays = false;
  }

  static unsigned long lastTeleCheck = 0;
  if (millis() - lastTeleCheck > (isEcoMode ? 2000 : 500)) {
    lastTeleCheck = millis();
    if (forceTelemetry || (millis() - lastTelemetryTime > reportInterval)) {
      if (Firebase.ready() && isInternetLive) {
        FirebaseJson j;
        for (int i = 0; i < 7; i++) {
          char k[16];
          sprintf(k, "relay%d", i + 1);
          j.set(k, relayState[i]);
          sprintf(k, "prio%d", i + 1);
          j.set(k, relayPriority[i]);
        }
        j.set("voltage", sharedVoltage);
        j.set("heap", (int)ESP.getFreeHeap());
        j.set("hubMac", WiFi.macAddress());
        j.set("isNight", globalLdrValue < globalLdrThreshold);
        j.set("lastUpdate", (double)millis());

        // Tiered Status (Safe Summary)
        FirebaseJson status;
        status.set("online", true);
        double ts = (time(nullptr) > 1000000) ? (double)time(nullptr)
                                              : (double)millis();
        status.set("lastSeen", ts);
        status.set("panic", isPanicActive);
        status.set("isArmed", isArmed);
        status.set("ldrValid", ldrValid);
        status.set("rssi", WiFi.RSSI());
        for (int i = 0; i < 7; i++) {
          char k[16];
          sprintf(k, "r%d", i + 1);
          status.set(k, relayState[i]);
        }
        String pathStatusNode = "devices/" + deviceId + "/status";
        Firebase.RTDB.updateNodeAsync(&fbTele, pathStatusNode.c_str(), &status);

        // Full Forensic Telemetry
        if (Firebase.RTDB.updateNodeAsync(&fbTele, pathTele.c_str(), &j)) {
          lastTelemetryTime = millis();
          forceTelemetry = false;
        }
      }
    }
  }

  // Automation Timer Logic
  unsigned long now = millis();
  for (int i = 0; i < 7; i++) {
    if (autoDuration[i] > 0 && isNeuralTriggered[i]) {
      if (now - autoTriggerTime[i] > (unsigned long)autoDuration[i] * 1000) {
        applyRelayUpdate(i, 0, 0);
        isNeuralTriggered[i] = false;
      }
    }
  }

  // 🏥 Self-Healing & Heap Guard (101% Stability)
  if (ESP.getFreeHeap() < 12000) {
    ESP.restart(); // Proactive memory safety
  }

  if (millis() - lastCloudActivity > 45000) {
    if (Firebase.ready() && isInternetLive) {
      Firebase.RTDB.beginStream(&fbStream, pathCmds.c_str());
      lastCloudActivity = millis();
    }
  }

  yield();
  esp_task_wdt_reset();
}
